'''
Title: River flows in you
Key: A大調(ABC#DEF#G#A)
Piano Sheet Source: https://douq.pixnet.net/blog/post/3862441
'''

tempo = 65

# 右手主旋律
right_score = [
    21, 20, 21, 20, 21, 16, 21, 14,  9, 13,  21, 20, 21, 20, 21, 16, 21, 14,  9, 13,
]

right_beat = [
    0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 4,  0.25, 0.25,  0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 4,  0.25, 0.25,
]

# 左手伴奏
left_score = [
    -6, 1, 4,  -10, -3, 2,  -6, 1, 4,  -10, -3, 2,
]

left_beat = [
    0.5, 0.5, 1, 0.5, 0.5, 5,  0.5, 0.5, 1, 0.5, 0.5, 5,
]